# 1. numpy — содержит большое количество мат. функций, нужна для решения СЛАУ (linalg.solve), работа с векторами, вычисления на массивах.

# 2. scipy — надстройка для numpy (для научных расчётов).
# Содержит алгоритмы для оптимизации, интегрирования (integrate), интерполяции (interpolate), линейной алгебры и т.д.
# Для чего — использование готовых численных методов вместо написания своего велосипеда.

# 3. matplotlib — главная библиотека для визуализации,
# для построения графиков функций, отображения сетки, для метода Эрмита,
# визуализации сходимости итераций.

# 4. realesgan (ИИ библиотека, супер резолюуия, метод сплайнов для фото)
